Tekla.Structures.Drawing.PointPlacing
The PointPlacing class defines a placing where the object is placed at
one point (the insertion point) without any additional placing options.

Tekla.Structures.Drawing.PointPlacing.#ctor
Creates a new point placing instance.
The value used for the placing is the parent object's insertion point in this case.

Tekla.Structures.Drawing.PointPlacing.#ctor(System.Boolean)
FOR INTERNAL USAGE!!!
Use Force = false to not override the PreferredPlacingType value.
Construct PointPlacing type.
The value used for placing is the Parent Objects InsertionPoint in this case.
Force: If true then forces the placing type to PointPlacing.

Tekla.Structures.Drawing.PointPlacing.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.